app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "post one"], ["body", "nne"], ["created_at", "2020-04-18 06:34:49.497570"], ["updated_at", "2020-04-18 06:34:49.497570"]]
---
	def create
		@post = Post.new(post_params)
		if(@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "nne asdf sdf "], ["updated_at", "2020-04-18 07:34:46.092263"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])
		if(@post.update(post_params))